<?php

namespace Database\Seeders;

use App\Models\Org;
use Illuminate\Database\Seeder;

class OrgsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $orgs = [
            ["name" => "ГБУЗ 'НИИ СП им. Н.В. Склифосовского ДЗМ'", "code" => 7744, "start" => 420000000, "end" => 439999999],
            ["name" => "ГКБ № 1 им. Н.И. Пирогова", "code" => 7711, "start" => 220000000, "end" => 239999999],
            ["name" => "ГБУЗ 'ГКБ им. М.П. Кончаловского ДЗМ'", "code" => 7730, "start" => 320000000, "end" => 339999999],
            ["name" => "ГБУЗ 'ГКБ имени В.М. Буянова ДЗМ'", "code" => 7743, "start" => 400000000, "end" => 419999999],
            ["name" => "ГБУЗ 'ГКБ № 15 ДЗМ'", "code" => 7715, "start" => 260000000, "end" => 279999999],
            ["name" => "ГБУЗ 'ГКБ им. А.К. Ерамишанцева ДЗМ'", "code" => 7720, "start" => 300000000, "end" => 319999999],
            ["name" => "ГБУЗ 'ГКБ № 52 ДЗМ'", "code" => 7752, "start" => 520000000, "end" => 539999999],
            ["name" => "ГБУЗ 'ГКБ № 67 им. Л. А. Ворохобова ДЗМ'", "code" => 7767, "start" => 840000000, "end" => 859999999],
            ["name" => "ГБУЗ 'ГКБ им. Е.О. Мухина ДЗМ'", "code" => 7770, "start" => 580000000, "end" => 599999999],
            ["name" => "ГБУЗ 'Морозовская ДТКБ ДЗМ'", "code" => 7749, "start" => 480000000, "end" => 499999999],
            ["name" => "ГБУЗ 'ГКБ им. С.С. Юдина ДЗМ'", "code" => 7747, "start" => 180000000, "end" => 199999999],
            ["name" => "ГБУЗ 'Центр Крови имени О.К. Гаврилова ДЗМ' (донорский центр на Беговой)", "code" => 7701, "start" => 100000000, "end" => 119999999],
            ["name" => "ГБУЗ 'Центр Крови имени О.К. Гаврилова ДЗМ' (донорский центр в Царицыно)", "code" => 7701, "start" => 860000000, "end" => 869999999],
            ["name" => "ГБУЗ 'Центр Крови имени О.К. Гаврилова ДЗМ' (донорский центр на Шаболовке)", "code" => 7701, "start" => 870000000, "end" => 879999999],
        ];
        foreach ($orgs as $org)
            Org::firstOrCreate([
                'name' => $org['name']], [
                'code' => $org['code'],
                'start' => $org['start'],
                'end' => $org['end'],
            ]);
    }
}
